program Project1Demo;

{$APPTYPE CONSOLE}

{$R *.res}

uses
  System.SysUtils;
{
 一、注释
  1.连接编译器
  2.编译：将我们的代码（文字）翻译成计算机能够识别的符号
  3.运行：计算机开始执行它能识别的符号

  命名规范
    1.见名知意：定义用英文
    2.驼峰原则：
          大驼峰:首字母大写
            StudentName
          小驼峰：首字母小写
            studentName


  二、数据类型
    1.数值型
        整数
        小数（实数）
    2.逻辑型
        真（True）非零为真 , 假(Flase) 0为假
    3.指针类型
    4.数组、子届、集合、自定义类型（结构体、类）
    5.字符串


  三、类型转换
    1.四舍五入
    2.自动类型转换：整数转小数
        取值范围小的数据类型向取值范围大的数据类型进行转换
    3.强制类型转换：小数转整数
        取值范围大的数据类型向取值范围小的数据类型进行转换
        格式：
           要转换成的数据类型（等待被转换的类型）
}

//Delphi 学习c系语言的注释方式

(*
  注释
*)
begin

end.
